app/Controllers/User_ajax.php

SELECT *
FROM `vot_user`
WHERE `usr_id` = '104'
 LIMIT 1
---
    public function get_user_ajax() {
        $usr_id = $this->request->getPost('usr_id');
        $m_usr = new M_vot_user();
        $data['obj_user'] = $m_usr
            ->where('usr_id', $usr_id)
            ->first();