app/Controllers/User_manage.php

SELECT *
FROM `vot_user`
LEFT JOIN `vot_role` ON `usr_role` = `rol_id`
LEFT JOIN `vot_cluster` ON `usr_cluster_id` = `cst_id`
ORDER BY `usr_id` DESC
SELECT *
FROM `vot_cluster`
ORDER BY `cst_id` ASC
SELECT *
FROM `vot_role`
ORDER BY `rol_id` ASC
---
    public function index() {
        session_start();
        if ($_SESSION["usr_role"] != '5') {
            echo "Access denied, Admin only";
            exit(0);
        }
        try {
            $m_usr = new M_vot_user();
            $data['arr_user'] = $m_usr
                ->orderBy('usr_id', 'DESC')
                ->join('vot_role', 'usr_role = rol_id', 'LEFT')
                ->join('vot_cluster', 'usr_cluster_id = cst_id', 'LEFT')
                ->findAll();

            $m_cst = new M_vot_cluster();
            $data['opt_cluster'] = $m_cst
                ->orderBy('cst_id', 'ASC')
                ->findAll();

            $m_rol = new M_vot_role();
            $data['opt_role'] = $m_rol
                ->orderBy('rol_id', 'ASC')
                ->findAll();